{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "実例で動かすグラフアルゴリズムとグラフデータベース、02_アルゴリズム編、PageRankで重要なアカウントを探す"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# カウントベースで小手調べ"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "まずナイーブに重要なアカウントはたくさんフォローされると考えて、よくフォローされているアカウントを調べてみます。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from tqdm.notebook import tqdm\n",
    "import json\n",
    "\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "auth_path = './data/neo4j_graph/auth.json'\n",
    "with open(auth_path, 'r') as f:\n",
    "    auth = json.load(f)\n",
    "\n",
    "# ローカルの場合は通常 uri: bolt(or neo4j)://localhost:7687, user: neo4j, pd: 設定したもの\n",
    "# サンドボックスの場合は作成画面から接続情報が見られます\n",
    "uri = 'neo4j://localhost:7687'\n",
    "driver = GraphDatabase.driver(uri=uri, auth=(auth['user'], auth['pd']))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Sandboxの場合はこんな感じ\n",
    "# uri = 'bolt://54.175.38.249:35275'\n",
    "# driver = GraphDatabase.driver(uri=uri, auth=('neo4j', 'spray-missile-sizing'))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "クエリ結果の数が多くなると表示の問題でNeo4j Browserが固まりやすくなりますが、プログラムなら問題なく扱えることがあります。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    MATCH (u:User)<-[r:FOLLOW]-(u2:User)--(g:Group)\n",
    "    RETURN u.userId as id, u.screenName as screen_name, u.name, count(DISTINCT r) as count\n",
    "    ORDER BY count DESC\n",
    "    ''')\n",
    "\n",
    "res = list(res)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(19944, 4)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>screen_name</th>\n",
       "      <th>u.name</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>204245399</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>139</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>104388107</td>\n",
       "      <td>konotarogomame</td>\n",
       "      <td>河野太郎</td>\n",
       "      <td>136</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>468122115</td>\n",
       "      <td>AbeShinzo</td>\n",
       "      <td>安倍晋三</td>\n",
       "      <td>129</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>245677083</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>123</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>265205959</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5</td>\n",
       "      <td>89631948</td>\n",
       "      <td>ecoyuri</td>\n",
       "      <td>小池百合子</td>\n",
       "      <td>110</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>6</td>\n",
       "      <td>96684891</td>\n",
       "      <td>kharaguchi</td>\n",
       "      <td>原口　一博</td>\n",
       "      <td>110</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>7</td>\n",
       "      <td>124415804</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>109</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>8</td>\n",
       "      <td>94482602</td>\n",
       "      <td>SekoHiroshige</td>\n",
       "      <td>世耕弘成 Hiroshige SEKO</td>\n",
       "      <td>108</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>9</td>\n",
       "      <td>169480493</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>108</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          id     screen_name               u.name  count\n",
       "0  204245399            None                 None    139\n",
       "1  104388107  konotarogomame                 河野太郎    136\n",
       "2  468122115       AbeShinzo                 安倍晋三    129\n",
       "3  245677083            None                 None    123\n",
       "4  265205959            None                 None    118\n",
       "5   89631948         ecoyuri                小池百合子    110\n",
       "6   96684891      kharaguchi                原口　一博    110\n",
       "7  124415804            None                 None    109\n",
       "8   94482602   SekoHiroshige  世耕弘成 Hiroshige SEKO    108\n",
       "9  169480493            None                 None    108"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res_df = pd.DataFrame.from_dict([r.data() for r in res])\n",
    "print(res_df.shape)\n",
    "res_df.head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "政治家アカウント以外のアカウントはIDしか情報がないのでscreen_nameやnameがnullとなっています。\n",
    "まず政治家について見てみます。\n",
    "政治家によくフォローされる政治家アカウントランキングです。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>screen_name</th>\n",
       "      <th>u.name</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>104388107</td>\n",
       "      <td>konotarogomame</td>\n",
       "      <td>河野太郎</td>\n",
       "      <td>136</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>468122115</td>\n",
       "      <td>AbeShinzo</td>\n",
       "      <td>安倍晋三</td>\n",
       "      <td>129</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5</td>\n",
       "      <td>89631948</td>\n",
       "      <td>ecoyuri</td>\n",
       "      <td>小池百合子</td>\n",
       "      <td>110</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>6</td>\n",
       "      <td>96684891</td>\n",
       "      <td>kharaguchi</td>\n",
       "      <td>原口　一博</td>\n",
       "      <td>110</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>8</td>\n",
       "      <td>94482602</td>\n",
       "      <td>SekoHiroshige</td>\n",
       "      <td>世耕弘成 Hiroshige SEKO</td>\n",
       "      <td>108</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>10</td>\n",
       "      <td>58359180</td>\n",
       "      <td>jimin_koho</td>\n",
       "      <td>自民党広報</td>\n",
       "      <td>107</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>11</td>\n",
       "      <td>94050482</td>\n",
       "      <td>ichita_y</td>\n",
       "      <td>山本一太</td>\n",
       "      <td>105</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>12</td>\n",
       "      <td>112551613</td>\n",
       "      <td>SatoMasahisa</td>\n",
       "      <td>佐藤正久</td>\n",
       "      <td>104</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>16</td>\n",
       "      <td>106595422</td>\n",
       "      <td>TAIRAMASAAKI</td>\n",
       "      <td>平将明</td>\n",
       "      <td>97</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>17</td>\n",
       "      <td>80985167</td>\n",
       "      <td>renho_sha</td>\n",
       "      <td>蓮　舫　・　立　憲　民　主　党　( り　っ　け　ん　)</td>\n",
       "      <td>97</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           id     screen_name                       u.name  count\n",
       "1   104388107  konotarogomame                         河野太郎    136\n",
       "2   468122115       AbeShinzo                         安倍晋三    129\n",
       "5    89631948         ecoyuri                        小池百合子    110\n",
       "6    96684891      kharaguchi                        原口　一博    110\n",
       "8    94482602   SekoHiroshige          世耕弘成 Hiroshige SEKO    108\n",
       "10   58359180      jimin_koho                        自民党広報    107\n",
       "11   94050482        ichita_y                         山本一太    105\n",
       "12  112551613    SatoMasahisa                         佐藤正久    104\n",
       "16  106595422    TAIRAMASAAKI                          平将明     97\n",
       "17   80985167       renho_sha  蓮　舫　・　立　憲　民　主　党　( り　っ　け　ん　)     97"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res_df[res_df.screen_name.notnull()].head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "首位３名は順当な感じがしますね、原口さんは最近あまりニュースで聞かない印象ですが、元総務大臣ということで、（すくなくともTwitter上では）影響力がある、かもしれません。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "次に政治家以外のアカウントについてですが、こちらは現在idしかなくて、\n",
    "idはtwitterがユーザアカウントに割り当てるもので、APIを使えば詳細を調べられますが、IDからユーザ情報、あるいはユーザ情報からIDを調べるツールもあります（https://idtwi.com/）。\n",
    "ここでは上位ユーザについての情報を追加収集しました。[こちら](https://github.com/lightondust/topics_by_jupyter_notebook/raw/master/data/neo4j_graph/politicians_0909_additional.json)からダウンロードできます。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "additional_data_path = './data/neo4j_graph/politicians_0909_additional.json'\n",
    "\n",
    "with open(additional_data_path, 'r') as f:\n",
    "    additional_user_data = json.load(f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "204245399, nhk_news, NHKニュース, 139\n",
      "245677083, hashimoto_lo, 橋下徹, 123\n",
      "265205959, Kantei_Saigai, 首相官邸(災害・危機管理情報), 118\n",
      "124415804, namatahara, 田原総一朗, 109\n",
      "169480493, nikkei, 日本経済新聞 電子版, 108\n",
      "412940784, kantei, 首相官邸, 103\n",
      "99008565, masason, 孫正義, 100\n",
      "109488235, Yomiuri_Online, 読売新聞オンライン, 97\n",
      "180585090, MHLWitter, 厚生労働省, 94\n",
      "42816371, asahi, 朝日新聞(asahi shimbun）, 93\n",
      "25073877, realDonaldTrump, Donald J. Trump, 89\n",
      "92686016, kenichiromogi, 茂木健一郎, 88\n",
      "297254593, kogashigeaki, 古賀茂明@フォーラム4, 87\n",
      "46282367, mainichijpnews, 毎日新聞ニュース, 86\n",
      "94701166, YoichiTakahashi, 高橋洋一（嘉悦大）, 85\n",
      "148961902, HeizoTakenaka, 竹中平蔵, 83\n",
      "97244324, hatoyamayukio, 鳩山友紀夫（由紀夫）Yukio Hatoyama, 82\n",
      "48264099, asao_keiichiro, あさお慶一郎　前衆議院議員, 81\n",
      "90521746, hmikitani, 三木谷浩史 H. Mikitani, 80\n",
      "4171231, tsuda, 津田大介, 80\n"
     ]
    }
   ],
   "source": [
    "for idx, item in res_df[res_df['screen_name'].isnull()].head(20).iterrows():\n",
    "    u_id = item['id']\n",
    "    count = item['count']\n",
    "    for u in additional_user_data:\n",
    "        if u['id'] == u_id:\n",
    "            user = u\n",
    "    print('{}, {}, {}, {}'.format(u_id, user['screen_name'], user['name'], count))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "案の定ニュース新聞系や関係の深いキャスターが出てきましたが、孫さんや三木谷さんなど社長が上位にランクインしたのが以外です。\n",
    "また橋下さん、竹中さん、鳩山さんなど元政治家が出てくるのも面白いですね。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "カウントベースで面白い結果が出ていますが、カウントベースだとたくさん人をフォローしている人がフォローしていても、本当に数人しか重要な人しかフォローしない人がフォローしていても、同じ１としてカウントされるので、本当に重要なノードが得られるとは限りません。次にPageRankを使って重要なユーザを探していきます。その前にPageRankなどのアルゴリズムを使うためのNeo4jのGraph　Data Science Librayについて説明します。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Neo4j Graph Data Science Library"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Neo4jはPageRankなどのグラフアルゴリズムを実行するためにGraph Data Science Libraryが用意されています。\n",
    "データベースには様々なタイプのデータや繋がりを登録したいが、実際にグラフアルゴリズムを使うときにはその中の一部の種類のノードとリレーションシップにフォーカスしたり、部分グラフに注目したり、あるいは既存のグラフから加工して新しいグラフを作った上でアルゴリズムを適応したいことがよくあります。\n",
    "そういうときにクエリと組み合わせて対象となるグラフを抽出・構成したり、事前にアルゴリズムに必要なリソースを見積もったりする便利な機能などが用意されています。\n",
    "\n",
    "インストールに関しては、Neo4j Desktopの場合は次のように「Manage」をクリックして、「Plugins」タブからインストールします。\n",
    "Neo4j Sandboxの場合は最初から入っているため、インストールは不要です。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src='./data/neo4j_graph/politician_02_install_gds1.png'>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src='./data/neo4j_graph/politician_02_install_gds2.png'>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## アルゴリズムを適応するためのグラフを定義します。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "データベースにはカテゴリとグループノードがありますが、PageRankを考える場合はUserノードとFOLLOW関係に集中します。\n",
    "実際に作る前にグラフを作るためのリソースを次のように見積もります。\n",
    "\n",
    "\n",
    "```\n",
    "CALL gds.graph.create.estimate('User', 'FOLLOW') YIELD nodeCount, relationshipCount, requiredMemory\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    CALL gds.graph.create.estimate('User', 'FOLLOW') YIELD nodeCount, relationshipCount, requiredMemory\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record nodeCount=19945 relationshipCount=166491 requiredMemory='[991 KiB ... 1055 KiB]'>]\n"
     ]
    }
   ],
   "source": [
    "res = list(res)\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "特に問題がなければ実際に作ります。\n",
    "グラフ名（「follow-net-all」）をつけます。\n",
    "\n",
    "```\n",
    "CALL gds.graph.create('follow-net-all', 'User', 'FOLLOW')\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    CALL gds.graph.create('follow-net-all', 'User', 'FOLLOW')\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "また、全アカウントじゃなくて政治家アカウントのみで計算したいことがあるかもしれません。\n",
    "その場合クエリを使ってネットワークを定義します。\n",
    "具体的にはノードのid、リレーションの始点と終点をリターンします。\n",
    "必要あればリレーションシップのウェイトを指定することもできます"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    CALL gds.graph.create.cypher.estimate( \n",
    "    'MATCH (g:Group)--(u:User) RETURN id(u) AS id', \n",
    "    'MATCH (:Group)--(u:User)-[r:FOLLOW]->(u2:User)--(:Group) WITH DISTINCT r, u, u2 RETURN id(u) AS source, id(u2) AS target')\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record requiredMemory='299 KiB' treeView=\"HugeGraph: 299 KiB\\n|-- this.instance: 72 Bytes\\n|-- nodeIdMap: 35 KiB\\n    |-- this.instance: 32 Bytes\\n    |-- Neo4j identifiers: 3088 Bytes\\n    |-- Mapping from Neo4j identifiers to internal identifiers: 32 KiB\\n    |-- Node Label BitSets: 0 Bytes\\n|-- adjacency list for 'RelationshipType{name='__ALL__'}': 256 KiB\\n    |-- this.instance: 24 Bytes\\n    |-- pages: 256 KiB\\n|-- adjacency offsets for 'RelationshipType{name='__ALL__'}': 8224 Bytes\\n    |-- this.instance: 16 Bytes\\n    |-- page: 8208 Bytes\\n\" mapView={'name': 'HugeGraph', 'components': [{'name': 'this.instance', 'memoryUsage': '72 Bytes'}, {'name': 'nodeIdMap', 'components': [{'name': 'this.instance', 'memoryUsage': '32 Bytes'}, {'name': 'Neo4j identifiers', 'memoryUsage': '3088 Bytes'}, {'name': 'Mapping from Neo4j identifiers to internal identifiers', 'memoryUsage': '32 KiB'}, {'name': 'Node Label BitSets', 'memoryUsage': '0 Bytes'}], 'memoryUsage': '35 KiB'}, {'name': \"adjacency list for 'RelationshipType{name='__ALL__'}'\", 'components': [{'name': 'this.instance', 'memoryUsage': '24 Bytes'}, {'name': 'pages', 'memoryUsage': '256 KiB'}], 'memoryUsage': '256 KiB'}, {'name': \"adjacency offsets for 'RelationshipType{name='__ALL__'}'\", 'components': [{'name': 'this.instance', 'memoryUsage': '16 Bytes'}, {'name': 'page', 'memoryUsage': '8208 Bytes'}], 'memoryUsage': '8224 Bytes'}], 'memoryUsage': '299 KiB'} bytesMin=306456 bytesMax=306456 nodeCount=381 relationshipCount=58 heapPercentageMin=0.1 heapPercentageMax=0.1>]\n"
     ]
    }
   ],
   "source": [
    "res = list(res)\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    CALL gds.graph.create.cypher( \n",
    "    'follow-net-politicians', \n",
    "    'MATCH (g:Group)--(u:User) WITH DISTINCT u as u RETURN id(u) AS id', \n",
    "    'MATCH (:Group)--(u:User)-[r:FOLLOW]->(u2:User)--(:Group) RETURN id(u) AS source, id(u2) AS target')\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "作ったグラフの一覧を見てみましょう。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    CALL gds.graph.list\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record graphName='follow-net-all' memoryUsage='5635 KiB' sizeInBytes=5770392 nodeProjection={'User': {'properties': {}, 'label': 'User'}} relationshipProjection={'FOLLOW': {'orientation': 'NATURAL', 'aggregation': 'DEFAULT', 'type': 'FOLLOW', 'properties': {}}} nodeQuery=None relationshipQuery=None nodeCount=19945 relationshipCount=166491 degreeDistribution={'p99': 170, 'min': 0, 'max': 2349, 'mean': 8.347505640511406, 'p90': 0, 'p50': 0, 'p999': 1612, 'p95': 0, 'p75': 0} creationTime=neo4j.time.DateTime(2020, 9, 15, 21, 9, 17.393649, tzinfo=<DstTzInfo 'Asia/Tokyo' JST+9:00:00 STD>) modificationTime=neo4j.time.DateTime(2020, 9, 15, 21, 9, 17.515731999) schema={'relationships': {'FOLLOW': {}}, 'nodes': {'User': {}}}>\n",
      "<Record graphName='follow-net-politicians' memoryUsage='462 KiB' sizeInBytes=473832 nodeProjection=None relationshipProjection=None nodeQuery='MATCH (g:Group)--(u:User) WITH DISTINCT u as u RETURN id(u) AS id' relationshipQuery='MATCH (:Group)--(u:User)-[r:FOLLOW]->(u2:User)--(:Group) RETURN id(u) AS source, id(u2) AS target' nodeCount=346 relationshipCount=13756 degreeDistribution={'p99': 193, 'min': 0, 'max': 239, 'mean': 39.75722543352601, 'p90': 88, 'p50': 28, 'p999': 239, 'p95': 128, 'p75': 57} creationTime=neo4j.time.DateTime(2020, 9, 15, 21, 9, 18.764751, tzinfo=<DstTzInfo 'Asia/Tokyo' JST+9:00:00 STD>) modificationTime=neo4j.time.DateTime(2020, 9, 15, 21, 9, 18.931898, tzinfo=<DstTzInfo 'Asia/Tokyo' JST+9:00:00 STD>) schema={'relationships': {'__ALL__': {}}, 'nodes': {'__ALL__': {}}}>\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[None, None]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = list(res)\n",
    "[print(r) for r in res]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "作成したグラフを削除するのは次のように行います。\n",
    "\n",
    "```\n",
    "CALL gds.graph.drop('follow_net_all');\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# PageRank"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "いよいよPageRankです。\n",
    "PageRankはGoogleの創業者たちが論文で提唱し、それをきっかけに創業したことで有名です。\n",
    "ざっくり言えば、重要な人にフォローされている人が重要である、との仮定に基づいてノードの重要度をスコアとして算出するものです。\n",
    "仮想ユーザをウェブ上にランダムにリンクを辿らせて遷移していった時に、そのユーザが各ノードに止まる確率のようなものです。\n",
    "\n",
    "さっそく実行してみます。\n",
    "\n",
    "```\n",
    "CALL gds.pageRank.stream('follow-net-all') YIELD nodeId, score\n",
    "WITH gds.util.asNode(nodeId) as u, score\n",
    "RETURN u.userId as id, u.name AS name, u.screenName as screen_name, score\n",
    "ORDER BY score DESC LIMIT 10\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    CALL gds.pageRank.stream('follow-net-all') YIELD nodeId, score\n",
    "    WITH gds.util.asNode(nodeId) as u, score\n",
    "    RETURN u.userId as id, u.name AS name, u.screenName as screen_name, score\n",
    "    ORDER BY score DESC LIMIT 200\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>screen_name</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>2291282737</td>\n",
       "      <td>細川護熙</td>\n",
       "      <td>morihirotokyo</td>\n",
       "      <td>0.452028</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>2298092184</td>\n",
       "      <td>小泉純一郎 J.Koizumi</td>\n",
       "      <td>J_Koizumi_Japan</td>\n",
       "      <td>0.346655</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>2481369336</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.342734</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>135029283</td>\n",
       "      <td>谷垣禎一</td>\n",
       "      <td>Tanigaki_S</td>\n",
       "      <td>0.339184</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>104388107</td>\n",
       "      <td>河野太郎</td>\n",
       "      <td>konotarogomame</td>\n",
       "      <td>0.325671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>195</td>\n",
       "      <td>759251</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.176333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>196</td>\n",
       "      <td>61324547</td>\n",
       "      <td>くしぶち万里　元衆議院議員</td>\n",
       "      <td>kushibuchi</td>\n",
       "      <td>0.176177</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>197</td>\n",
       "      <td>345178332</td>\n",
       "      <td>衆議院議員森山浩行@立憲民主党堺（りっけん）</td>\n",
       "      <td>MORIYAMAhiro</td>\n",
       "      <td>0.176125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>198</td>\n",
       "      <td>1195640294261182466</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.176123</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>199</td>\n",
       "      <td>613201682</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.176091</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>200 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                      id                    name      screen_name     score\n",
       "0             2291282737                    細川護熙    morihirotokyo  0.452028\n",
       "1             2298092184         小泉純一郎 J.Koizumi  J_Koizumi_Japan  0.346655\n",
       "2             2481369336                    None             None  0.342734\n",
       "3              135029283                    谷垣禎一       Tanigaki_S  0.339184\n",
       "4              104388107                    河野太郎   konotarogomame  0.325671\n",
       "..                   ...                     ...              ...       ...\n",
       "195               759251                    None             None  0.176333\n",
       "196             61324547           くしぶち万里　元衆議院議員       kushibuchi  0.176177\n",
       "197            345178332  衆議院議員森山浩行@立憲民主党堺（りっけん）     MORIYAMAhiro  0.176125\n",
       "198  1195640294261182466                    None             None  0.176123\n",
       "199            613201682                    None             None  0.176091\n",
       "\n",
       "[200 rows x 4 columns]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = list(res)\n",
    "res_df = pd.DataFrame([r.data() for r in res])\n",
    "\n",
    "res_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "今が人気だけじゃなくて、陰の実力者のアカウントもすこしあぶり出された、というような気もしますね。\n",
    "圧倒的重要さを誇るのは細川さん（二位とのスコア差が大きい）です。\n",
    "細川さんも小泉さんも元総理という重要なポジションであり、そしてカウントベースではむしろ下位に位置していることを考えれば、PageRankがよく機能していると言えるかもしれません。\n",
    "\n",
    "政治家以外のアカウントを見てみます。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2, 2481369336, None, None, 0.3427342087764733\n",
      "7, 245677083, hashimoto_lo, 橋下徹, 0.3104444960829783\n",
      "10, 305320802, None, None, 0.29620774772489844\n",
      "15, 265205959, Kantei_Saigai, 首相官邸(災害・危機管理情報), 0.26993426864236714\n",
      "18, 99008565, masason, 孫正義, 0.25991508577836087\n",
      "19, 25073877, realDonaldTrump, Donald J. Trump, 0.25841955984103876\n",
      "21, 204245399, nhk_news, NHKニュース, 0.2536393801962411\n",
      "23, 69861141, None, None, 0.25213300565757085\n",
      "28, 124415804, namatahara, 田原総一朗, 0.23418672573544158\n",
      "33, 42816371, asahi, 朝日新聞(asahi shimbun）, 0.22684923383383965\n",
      "35, 903338594, sugawitter, 菅 義偉, 0.22650765601559872\n",
      "36, 412940784, kantei, 首相官邸, 0.22143552415051596\n",
      "37, 169480493, nikkei, 日本経済新聞 電子版, 0.2214105514823688\n",
      "39, 48264099, asao_keiichiro, あさお慶一郎　前衆議院議員, 0.22006568025766313\n",
      "40, 275355095, None, None, 0.2186452617306928\n",
      "41, 297254593, kogashigeaki, 古賀茂明@フォーラム4, 0.2180277926388264\n",
      "43, 148961902, HeizoTakenaka, 竹中平蔵, 0.2163264090153946\n",
      "44, 90521746, hmikitani, 三木谷浩史 H. Mikitani, 0.21538645175146418\n",
      "45, 97244324, hatoyamayukio, 鳩山友紀夫（由紀夫）Yukio Hatoyama, 0.21532410236155686\n",
      "47, 94701166, YoichiTakahashi, 高橋洋一（嘉悦大）, 0.21393892916563398\n",
      "50, 4171231, tsuda, 津田大介, 0.2098406468463505\n",
      "51, 125546634, inosenaoki, 猪瀬直樹/inosenaoki, 0.20975741127313868\n",
      "52, 813286, BarackObama, Barack Obama, 0.2087002847850184\n",
      "53, 180585090, MHLWitter, 厚生労働省, 0.20812258278635004\n",
      "54, 152963467, h_ototake, 乙武 洋匡, 0.20755117455601368\n",
      "55, 362401254, katsuyatakasu, 高須克弥, 0.20747994474473588\n",
      "59, 109488235, Yomiuri_Online, 読売新聞オンライン, 0.20635277959377565\n",
      "60, 123482369, ryosei_akazawa, 赤沢りょうせい, 0.20614831325669938\n",
      "63, 822215679726100480, POTUS, President Trump, 0.20425882498424552\n",
      "66, 154008650, j_nsc_jp, 自民党ネットサポーターズクラブ, 0.20137576245809644\n",
      "67, 62473909, matsuikoji, Koji Matsui 松井孝治, 0.20108293464226812\n",
      "69, 112162183, ShinichiUeyama, 上山信一 Ueyama, 0.2003818912157054\n",
      "70, 268732024, ModJapan_jp, 防衛省・自衛隊, 0.20034833494115584\n",
      "74, 49540955, mainichi, 毎日新聞, 0.19810605501299933\n",
      "75, 129415880, kb2474, 小林史明（衆議院議員/広島7区/福山市）, 0.19672401711892104\n",
      "76, 1023584077, tokyo_bousai, 東京都防災, 0.19484444299733225\n",
      "78, 822215673812119553, WhiteHouse, The White House, 0.19388906478071036\n",
      "79, 92686016, kenichiromogi, 茂木健一郎, 0.19387121444335578\n",
      "82, 955610533553557504, cdp_kokkai, 立憲民主党（りっけん）国会情報+災害対策, 0.19293712724430465\n",
      "83, 265814534, JGSDF_pr, 陸上自衛隊, 0.1926993602591548\n",
      "84, 571429134, MLIT_JAPAN, 国土交通省, 0.1922364995070073\n",
      "86, 108613869, YoshikoSakurai, 櫻井よしこ, 0.19185682166326903\n",
      "87, 145991905, hyakutanaoki, 百田尚樹, 0.1911795806793184\n",
      "89, 324798061, None, None, 0.19072280522500024\n",
      "92, 892631430601121792, Akira_Amari, 甘利 明, 0.18985198432554182\n",
      "93, 69259365, Hiroki_Komazaki, 駒崎弘樹 （ Hiroki Komazaki ）@休校休園シッターやってます, 0.18982817962325238\n",
      "96, 303730149, MofaJapan_jp, 外務省, 0.1896383084940912\n",
      "99, 118990869, ohmaebot, 大前研一　BOT, 0.18839299321152053\n",
      "102, 242156036, mextjapan, 文部科学省　MEXT, 0.18699717326034254\n",
      "103, 113101038, None, None, 0.18680849035317407\n",
      "105, 397068310, None, None, 0.18644947771755613\n",
      "108, 137272821, FDMA_JAPAN, 総務省消防庁, 0.18596699745538303\n",
      "109, 2481947221, KentGilbert01, ケント・ギルバート, 0.18591218625543313\n",
      "110, 157057698, arimoto_kaori, 有本  香  Kaori Arimoto, 0.18586378713780768\n",
      "112, 86930463, YoshitoHori, 堀義人, 0.1857433775692092\n",
      "113, 1147231333, CAO_BOUSAI, 内閣府防災, 0.1857067828972556\n",
      "114, 44791521, takapon_jp, 堀江貴文(Takafumi Horie), 0.18568274897993312\n",
      "115, 266566401, meti_NIPPON, 経済産業省, 0.1856077014872315\n",
      "117, 1247032696586436609, kishida230, 岸田文雄, 0.1847897004206746\n",
      "118, 273629780, JMSDF_PAO, 防衛省 海上自衛隊, 0.1847049074112551\n",
      "120, 399961813, None, None, 0.1843306509399238\n",
      "122, 1129803169, None, None, 0.18403536495567563\n",
      "124, 116106121, nobuogohara, 郷原信郎【「深層」カルロス・ゴーンとの対話　起訴されれば９９％超が有罪となる国で】, 0.18374881500200543\n",
      "125, 490918532, None, None, 0.18374311814294367\n",
      "126, 242646380, takenoma, 竹田恒泰, 0.18364140286272643\n",
      "130, 134690184, nagano_t, 長野智子, 0.18318162502162746\n",
      "131, 1471270106, sasaki_stop_tpp, 佐々木 隆博 （りっけん）STOP TPP！, 0.18317795611509216\n",
      "133, 52558860, fujisue, 藤末 健三, 0.18275200010064885\n",
      "135, 25991694, dave_spector, デーブ・スペクター, 0.1825830086750261\n",
      "136, 256401886, nhk_seikatsu, ＮＨＫ生活・防災, 0.1822534412816662\n",
      "137, 93311525, NHK_PR, NHK広報局, 0.18224885185777245\n",
      "139, 46282367, mainichijpnews, 毎日新聞ニュース, 0.18217427968009203\n",
      "140, 75239976, otokita, 音喜多 駿（参議院議員 / 東京都選出）, 0.18175659059077337\n",
      "143, 914730945978277888, rikken_minshu, 立　憲　民　主　く　ん, 0.18144885724123264\n",
      "144, 335291833, None, None, 0.1813750470647575\n",
      "145, 136143835, oonomotohiro, 大野もとひろ　埼玉県知事, 0.1812706714788419\n",
      "147, 119363202, ISOKO_MOCHIZUKI, 望月衣塑子, 0.18110678151243106\n",
      "150, 136414215, kobahawk, 小林鷹之, 0.18066354027711987\n",
      "151, 562773398, Sankei_news, 産経ニュース, 0.18058341773364556\n",
      "154, 143383314, jijicom, 時事ドットコム（時事通信ニュース）, 0.18010954539681714\n",
      "157, 73883832, None, None, 0.17978870365950694\n",
      "159, 5302692, None, None, 0.17969937850734702\n",
      "161, 43041891, tenkijp, tenki.jp, 0.1791967665769542\n",
      "163, 4104111, earthquake_jp, 地震速報, 0.17908813798798412\n",
      "164, 246077279, None, None, 0.17900204007596127\n",
      "165, 24611873, ikedanob, 池田信夫, 0.17897506203082392\n",
      "166, 213983356, None, None, 0.1788476094606633\n",
      "168, 241940163, asahi_kantei, 朝日新聞官邸クラブ, 0.17850208032702705\n",
      "169, 1471392018, None, None, 0.17840109754174943\n",
      "171, 58166411, None, None, 0.17786704657064129\n",
      "172, 7080152, TwitterJP, Twitter Japan, 0.17771195291905378\n",
      "175, 98891836, iwakamiyasumi, 岩上安身, 0.17767578537667805\n",
      "177, 49559086, WSJJapan, ウォール・ストリート・ジャーナル日本版, 0.1773978969824948\n",
      "178, 58180294, TakemiKeizo, 武見 敬三（自民党 参議院議員・東京）, 0.17726661916338377\n",
      "179, 1369335487, None, None, 0.17725135091273195\n",
      "180, 14486011, susumu_fujita, 藤田晋, 0.17723201992147108\n",
      "182, 1900694785, None, None, 0.1770365570160792\n",
      "183, 2357816610, miraisyakai, 三春充希(はる) ⭐みらい選挙プロジェクト, 0.1770215724520832\n",
      "185, 192521447, magosaki_ukeru, 孫崎　享, 0.17691394227000404\n",
      "187, 98862229, TK_Mitsuhashi, 三橋貴明, 0.17688446420804915\n",
      "189, 106258698, masaru_kaneko, 金子勝, 0.17665470077907522\n",
      "190, 60249070, None, None, 0.17659209971929363\n",
      "191, 95367060, kokumin_hiroba, 140文字じゃ物足りない人向けの議論型SNS「国民の広場」, 0.1765601771226689\n",
      "192, 206942049, None, None, 0.17654404588849174\n",
      "194, 2856291696, Naikakukanbo, 内閣官房, 0.17644700016939285\n",
      "195, 759251, CNN, CNN, 0.1763328319236018\n",
      "198, 1195640294261182466, None, None, 0.1761228375251624\n",
      "199, 613201682, None, None, 0.1760910150378004\n"
     ]
    }
   ],
   "source": [
    "for k, item in res_df[res_df.name.isnull()].iterrows():\n",
    "    user = {}\n",
    "    u_id = item['id']\n",
    "    for u in additional_user_data:\n",
    "        if u['id'] == u_id:\n",
    "            user = u\n",
    "    print('{}, {}, {}, {}, {}'.format(k, u_id, user.get('screen_name'), user.get('name'), item['score']))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "データがないアカウントはフォローしている政治家アカウントがすくないものの、重要な政治家アカウントにフォローされているということですね。\n",
    "高い順で「一般社団法人自然エネルギー推進会議」と「古川元久事務所」です。\n",
    "「一般社団法人自然エネルギー推進会議」は名前だけからするとなにやら目立たないけれど有力者とつながってそうな匂いを感じてしまいます。\n",
    "「古川元久事務所」は政治家のアカウントですが、スクレイピング元のデータに欠損がありました。\n",
    "これは逆に考えれば、グラフデータのラベルに欠損がつきものであるが、グラフアルゴリズムを使うことで一部のラベルだけから効率よく残りの類似ノードを見つけられるということかもしれません。\n",
    "\n",
    "次にDamping Factorを変えてみます\n",
    "Damping Factorはdefaultの0.85で設定されています。\n",
    "詳細の説明は割愛しますが、循環参照（もともと論文の場合は先行研究しか引用しないので通常循環参照が生じない）があるとスコアがそこに集中したり、収束しないことがありますが、それを抑えるのがDumping Factorです。\n",
    "Dampling Factorの値が大きい（１に近い）と抑えが効かず値が収束しにくかったり、循環参照のスコアが不正に大きくなりがちだが、小さいとスコアが伝搬せずグラフの構造を反映できなくなってしまいます。\n",
    "0.85で使うことが多いです。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    CALL gds.pageRank.stream('follow-net-all', {dampingFactor: 0.75}) YIELD nodeId, score\n",
    "    WITH gds.util.asNode(nodeId) as u, score\n",
    "    RETURN u.userId as id, u.name AS name, u.screenName as screen_name, score\n",
    "    ORDER BY score DESC LIMIT 20\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>screen_name</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>2291282737</td>\n",
       "      <td>細川護熙</td>\n",
       "      <td>morihirotokyo</td>\n",
       "      <td>0.630261</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>135029283</td>\n",
       "      <td>谷垣禎一</td>\n",
       "      <td>Tanigaki_S</td>\n",
       "      <td>0.523063</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>104388107</td>\n",
       "      <td>河野太郎</td>\n",
       "      <td>konotarogomame</td>\n",
       "      <td>0.502890</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>2298092184</td>\n",
       "      <td>小泉純一郎 J.Koizumi</td>\n",
       "      <td>J_Koizumi_Japan</td>\n",
       "      <td>0.492805</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>58359180</td>\n",
       "      <td>自民党広報</td>\n",
       "      <td>jimin_koho</td>\n",
       "      <td>0.492129</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5</td>\n",
       "      <td>468122115</td>\n",
       "      <td>安倍晋三</td>\n",
       "      <td>AbeShinzo</td>\n",
       "      <td>0.491159</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>6</td>\n",
       "      <td>2481369336</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.487239</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>7</td>\n",
       "      <td>245677083</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.481302</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>8</td>\n",
       "      <td>94050482</td>\n",
       "      <td>山本一太</td>\n",
       "      <td>ichita_y</td>\n",
       "      <td>0.465500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>9</td>\n",
       "      <td>122343424</td>\n",
       "      <td>松本純</td>\n",
       "      <td>junmatsumoto411</td>\n",
       "      <td>0.462421</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>10</td>\n",
       "      <td>305320802</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.461928</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>11</td>\n",
       "      <td>914762049481084929</td>\n",
       "      <td>立憲民主党（りっけん）</td>\n",
       "      <td>CDP2017</td>\n",
       "      <td>0.460617</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>12</td>\n",
       "      <td>89631948</td>\n",
       "      <td>小池百合子</td>\n",
       "      <td>ecoyuri</td>\n",
       "      <td>0.460385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>13</td>\n",
       "      <td>94482602</td>\n",
       "      <td>世耕弘成 Hiroshige SEKO</td>\n",
       "      <td>SekoHiroshige</td>\n",
       "      <td>0.449965</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>14</td>\n",
       "      <td>112551613</td>\n",
       "      <td>佐藤正久</td>\n",
       "      <td>SatoMasahisa</td>\n",
       "      <td>0.436635</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>15</td>\n",
       "      <td>265205959</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.423003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>16</td>\n",
       "      <td>134715633</td>\n",
       "      <td>松井一郎(大阪市長)</td>\n",
       "      <td>gogoichiro</td>\n",
       "      <td>0.413342</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>17</td>\n",
       "      <td>106595422</td>\n",
       "      <td>平将明</td>\n",
       "      <td>TAIRAMASAAKI</td>\n",
       "      <td>0.411991</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>18</td>\n",
       "      <td>99008565</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.409122</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>19</td>\n",
       "      <td>83774916</td>\n",
       "      <td>平井卓也（ひらいたくや）</td>\n",
       "      <td>hiratakuchan</td>\n",
       "      <td>0.405061</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                    id                 name      screen_name     score\n",
       "0           2291282737                 細川護熙    morihirotokyo  0.630261\n",
       "1            135029283                 谷垣禎一       Tanigaki_S  0.523063\n",
       "2            104388107                 河野太郎   konotarogomame  0.502890\n",
       "3           2298092184      小泉純一郎 J.Koizumi  J_Koizumi_Japan  0.492805\n",
       "4             58359180                自民党広報       jimin_koho  0.492129\n",
       "5            468122115                 安倍晋三        AbeShinzo  0.491159\n",
       "6           2481369336                 None             None  0.487239\n",
       "7            245677083                 None             None  0.481302\n",
       "8             94050482                 山本一太         ichita_y  0.465500\n",
       "9            122343424                  松本純  junmatsumoto411  0.462421\n",
       "10           305320802                 None             None  0.461928\n",
       "11  914762049481084929          立憲民主党（りっけん）          CDP2017  0.460617\n",
       "12            89631948                小池百合子          ecoyuri  0.460385\n",
       "13            94482602  世耕弘成 Hiroshige SEKO    SekoHiroshige  0.449965\n",
       "14           112551613                 佐藤正久     SatoMasahisa  0.436635\n",
       "15           265205959                 None             None  0.423003\n",
       "16           134715633           松井一郎(大阪市長)       gogoichiro  0.413342\n",
       "17           106595422                  平将明     TAIRAMASAAKI  0.411991\n",
       "18            99008565                 None             None  0.409122\n",
       "19            83774916         平井卓也（ひらいたくや）     hiratakuchan  0.405061"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = list(res)\n",
    "res_df = pd.DataFrame([r.data() for r in res])\n",
    "\n",
    "res_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "多少順番が入れ替わった感じですね。\n",
    "\n",
    "次にネットワークを政治家ノードに限定して算出します。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    CALL gds.pageRank.stream('follow-net-politicians') YIELD nodeId, score\n",
    "    WITH gds.util.asNode(nodeId) as u, score\n",
    "    RETURN u.userId as id, u.name AS name, u.screenName as screen_name, score\n",
    "    ORDER BY score DESC LIMIT 20\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>screen_name</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>58359180</td>\n",
       "      <td>自民党広報</td>\n",
       "      <td>jimin_koho</td>\n",
       "      <td>4.628814</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>112551613</td>\n",
       "      <td>佐藤正久</td>\n",
       "      <td>SatoMasahisa</td>\n",
       "      <td>4.434653</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>89631948</td>\n",
       "      <td>小池百合子</td>\n",
       "      <td>ecoyuri</td>\n",
       "      <td>3.974174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>134715633</td>\n",
       "      <td>松井一郎(大阪市長)</td>\n",
       "      <td>gogoichiro</td>\n",
       "      <td>3.398299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>145599783</td>\n",
       "      <td>吉村洋文（大阪府知事）</td>\n",
       "      <td>hiroyoshimura</td>\n",
       "      <td>3.087031</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5</td>\n",
       "      <td>468122115</td>\n",
       "      <td>安倍晋三</td>\n",
       "      <td>AbeShinzo</td>\n",
       "      <td>2.958654</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>6</td>\n",
       "      <td>104388107</td>\n",
       "      <td>河野太郎</td>\n",
       "      <td>konotarogomame</td>\n",
       "      <td>2.634810</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>7</td>\n",
       "      <td>2291282737</td>\n",
       "      <td>細川護熙</td>\n",
       "      <td>morihirotokyo</td>\n",
       "      <td>2.615294</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>8</td>\n",
       "      <td>2298092184</td>\n",
       "      <td>小泉純一郎 J.Koizumi</td>\n",
       "      <td>J_Koizumi_Japan</td>\n",
       "      <td>2.547026</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>9</td>\n",
       "      <td>94050482</td>\n",
       "      <td>山本一太</td>\n",
       "      <td>ichita_y</td>\n",
       "      <td>2.519077</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>10</td>\n",
       "      <td>914762049481084929</td>\n",
       "      <td>立憲民主党（りっけん）</td>\n",
       "      <td>CDP2017</td>\n",
       "      <td>2.296642</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>11</td>\n",
       "      <td>96684891</td>\n",
       "      <td>原口　一博</td>\n",
       "      <td>kharaguchi</td>\n",
       "      <td>2.228331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>12</td>\n",
       "      <td>94482602</td>\n",
       "      <td>世耕弘成 Hiroshige SEKO</td>\n",
       "      <td>SekoHiroshige</td>\n",
       "      <td>2.205480</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>13</td>\n",
       "      <td>135029283</td>\n",
       "      <td>谷垣禎一</td>\n",
       "      <td>Tanigaki_S</td>\n",
       "      <td>2.131317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>14</td>\n",
       "      <td>106595422</td>\n",
       "      <td>平将明</td>\n",
       "      <td>TAIRAMASAAKI</td>\n",
       "      <td>2.000736</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>15</td>\n",
       "      <td>2590575655</td>\n",
       "      <td>ここりん（公式）</td>\n",
       "      <td>nipponkokoro</td>\n",
       "      <td>1.966871</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>16</td>\n",
       "      <td>83774916</td>\n",
       "      <td>平井卓也（ひらいたくや）</td>\n",
       "      <td>hiratakuchan</td>\n",
       "      <td>1.852419</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>17</td>\n",
       "      <td>76031812</td>\n",
       "      <td>浅田 均（参議院議員）</td>\n",
       "      <td>asalogue</td>\n",
       "      <td>1.826080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>18</td>\n",
       "      <td>119577038</td>\n",
       "      <td>公明党</td>\n",
       "      <td>komei_koho</td>\n",
       "      <td>1.756745</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>19</td>\n",
       "      <td>80985167</td>\n",
       "      <td>蓮　舫　・　立　憲　民　主　党　( り　っ　け　ん　)</td>\n",
       "      <td>renho_sha</td>\n",
       "      <td>1.713555</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                    id                         name      screen_name     score\n",
       "0             58359180                        自民党広報       jimin_koho  4.628814\n",
       "1            112551613                         佐藤正久     SatoMasahisa  4.434653\n",
       "2             89631948                        小池百合子          ecoyuri  3.974174\n",
       "3            134715633                   松井一郎(大阪市長)       gogoichiro  3.398299\n",
       "4            145599783                  吉村洋文（大阪府知事）    hiroyoshimura  3.087031\n",
       "5            468122115                         安倍晋三        AbeShinzo  2.958654\n",
       "6            104388107                         河野太郎   konotarogomame  2.634810\n",
       "7           2291282737                         細川護熙    morihirotokyo  2.615294\n",
       "8           2298092184              小泉純一郎 J.Koizumi  J_Koizumi_Japan  2.547026\n",
       "9             94050482                         山本一太         ichita_y  2.519077\n",
       "10  914762049481084929                  立憲民主党（りっけん）          CDP2017  2.296642\n",
       "11            96684891                        原口　一博       kharaguchi  2.228331\n",
       "12            94482602          世耕弘成 Hiroshige SEKO    SekoHiroshige  2.205480\n",
       "13           135029283                         谷垣禎一       Tanigaki_S  2.131317\n",
       "14           106595422                          平将明     TAIRAMASAAKI  2.000736\n",
       "15          2590575655                     ここりん（公式）     nipponkokoro  1.966871\n",
       "16            83774916                 平井卓也（ひらいたくや）     hiratakuchan  1.852419\n",
       "17            76031812                  浅田 均（参議院議員）         asalogue  1.826080\n",
       "18           119577038                          公明党       komei_koho  1.756745\n",
       "19            80985167  蓮　舫　・　立　憲　民　主　党　( り　っ　け　ん　)        renho_sha  1.713555"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = list(res)\n",
    "res_df = pd.DataFrame([r.data() for r in res])\n",
    "\n",
    "res_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "また、全政治家ではなく、自民党内での重要性を見てみます。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run(  \n",
    "        '''\n",
    "        CALL gds.graph.create.cypher(  \n",
    "        'follow-net-parties',  \n",
    "        'MATCH (g:Group {name:\"自由民主党\"})--(u:User) RETURN id(u) AS id',  \n",
    "        'MATCH (g:Group {name:\"自由民主党\"})--(u:User)-[r:FOLLOW]->(u2:User)--(g) WITH DISTINCT r, u, u2 RETURN id(u) AS source, id(u2) AS target') \n",
    "        ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    CALL gds.pageRank.stream('follow-net-parties') YIELD nodeId, score\n",
    "    WITH gds.util.asNode(nodeId) as u, score\n",
    "    RETURN u.userId as id, u.name AS name, u.screenName as screen_name, score\n",
    "    ORDER BY score DESC LIMIT 20\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>screen_name</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>112551613</td>\n",
       "      <td>佐藤正久</td>\n",
       "      <td>SatoMasahisa</td>\n",
       "      <td>2.940377</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>58359180</td>\n",
       "      <td>自民党広報</td>\n",
       "      <td>jimin_koho</td>\n",
       "      <td>2.151208</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>135029283</td>\n",
       "      <td>谷垣禎一</td>\n",
       "      <td>Tanigaki_S</td>\n",
       "      <td>1.994588</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>468122115</td>\n",
       "      <td>安倍晋三</td>\n",
       "      <td>AbeShinzo</td>\n",
       "      <td>1.799998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>104388107</td>\n",
       "      <td>河野太郎</td>\n",
       "      <td>konotarogomame</td>\n",
       "      <td>1.745840</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5</td>\n",
       "      <td>83774916</td>\n",
       "      <td>平井卓也（ひらいたくや）</td>\n",
       "      <td>hiratakuchan</td>\n",
       "      <td>1.619778</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>6</td>\n",
       "      <td>94050482</td>\n",
       "      <td>山本一太</td>\n",
       "      <td>ichita_y</td>\n",
       "      <td>1.603370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>7</td>\n",
       "      <td>94482602</td>\n",
       "      <td>世耕弘成 Hiroshige SEKO</td>\n",
       "      <td>SekoHiroshige</td>\n",
       "      <td>1.591588</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>8</td>\n",
       "      <td>106595422</td>\n",
       "      <td>平将明</td>\n",
       "      <td>TAIRAMASAAKI</td>\n",
       "      <td>1.451602</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>9</td>\n",
       "      <td>122343424</td>\n",
       "      <td>松本純</td>\n",
       "      <td>junmatsumoto411</td>\n",
       "      <td>1.385155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>10</td>\n",
       "      <td>78646435</td>\n",
       "      <td>片山さつき</td>\n",
       "      <td>katayama_s</td>\n",
       "      <td>1.111217</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>11</td>\n",
       "      <td>148169494</td>\n",
       "      <td>柴山昌彦</td>\n",
       "      <td>shiba_masa</td>\n",
       "      <td>1.076998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>12</td>\n",
       "      <td>91760590</td>\n",
       "      <td>牧島かれん</td>\n",
       "      <td>makishimakaren</td>\n",
       "      <td>1.043077</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>13</td>\n",
       "      <td>95405735</td>\n",
       "      <td>あいさわ一郎</td>\n",
       "      <td>ichiroaisawa</td>\n",
       "      <td>0.938201</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>14</td>\n",
       "      <td>99275472</td>\n",
       "      <td>熊谷 ゆたか</td>\n",
       "      <td>kumagai_yutaka</td>\n",
       "      <td>0.925106</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>15</td>\n",
       "      <td>137884361</td>\n",
       "      <td>三原じゅん子</td>\n",
       "      <td>miharajunco</td>\n",
       "      <td>0.920131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>16</td>\n",
       "      <td>202979703</td>\n",
       "      <td>茂木敏充</td>\n",
       "      <td>moteging</td>\n",
       "      <td>0.903428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>17</td>\n",
       "      <td>12458472</td>\n",
       "      <td>新藤　義孝</td>\n",
       "      <td>shindo_y</td>\n",
       "      <td>0.842672</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>18</td>\n",
       "      <td>246575371</td>\n",
       "      <td>山本ともひろ℗</td>\n",
       "      <td>ty_polepole</td>\n",
       "      <td>0.841348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>19</td>\n",
       "      <td>135884288</td>\n",
       "      <td>宮川典子</td>\n",
       "      <td>norikomiya</td>\n",
       "      <td>0.834485</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           id                 name      screen_name     score\n",
       "0   112551613                 佐藤正久     SatoMasahisa  2.940377\n",
       "1    58359180                自民党広報       jimin_koho  2.151208\n",
       "2   135029283                 谷垣禎一       Tanigaki_S  1.994588\n",
       "3   468122115                 安倍晋三        AbeShinzo  1.799998\n",
       "4   104388107                 河野太郎   konotarogomame  1.745840\n",
       "5    83774916         平井卓也（ひらいたくや）     hiratakuchan  1.619778\n",
       "6    94050482                 山本一太         ichita_y  1.603370\n",
       "7    94482602  世耕弘成 Hiroshige SEKO    SekoHiroshige  1.591588\n",
       "8   106595422                  平将明     TAIRAMASAAKI  1.451602\n",
       "9   122343424                  松本純  junmatsumoto411  1.385155\n",
       "10   78646435                片山さつき       katayama_s  1.111217\n",
       "11  148169494                 柴山昌彦       shiba_masa  1.076998\n",
       "12   91760590                牧島かれん   makishimakaren  1.043077\n",
       "13   95405735               あいさわ一郎     ichiroaisawa  0.938201\n",
       "14   99275472               熊谷 ゆたか   kumagai_yutaka  0.925106\n",
       "15  137884361               三原じゅん子      miharajunco  0.920131\n",
       "16  202979703                 茂木敏充         moteging  0.903428\n",
       "17   12458472                新藤　義孝         shindo_y  0.842672\n",
       "18  246575371              山本ともひろ℗      ty_polepole  0.841348\n",
       "19  135884288                 宮川典子       norikomiya  0.834485"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = list(res)\n",
    "res_df = pd.DataFrame([r.data() for r in res])\n",
    "\n",
    "res_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "民進党内を見てみます"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "        CALL gds.graph.drop('follow-net-parties')\n",
    "    ''')\n",
    "    res = session.run(  \n",
    "        '''\n",
    "        CALL gds.graph.create.cypher(  \n",
    "        'follow-net-parties',  \n",
    "        'MATCH (g:Group {name:\"自由民主党\"})--(u:User) RETURN id(u) AS id',  \n",
    "        'MATCH (g:Group {name:\"自由民主党\"})--(u:User)-[r:FOLLOW]->(u2:User)--(g) WITH DISTINCT r, u, u2 RETURN id(u) AS source, id(u2) AS target') \n",
    "        '''.replace('自由民主党', '民進党'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run('''\n",
    "    CALL gds.pageRank.stream('follow-net-parties') YIELD nodeId, score\n",
    "    WITH gds.util.asNode(nodeId) as u, score\n",
    "    RETURN u.userId as id, u.name AS name, u.screenName as screen_name, score\n",
    "    ORDER BY score DESC LIMIT 20\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>screen_name</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>107039196</td>\n",
       "      <td>福山哲郎・立憲民主党（りっけん）</td>\n",
       "      <td>fuku_tetsu</td>\n",
       "      <td>1.718304</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>174604776</td>\n",
       "      <td>川内 博史</td>\n",
       "      <td>kawauchihiroshi</td>\n",
       "      <td>1.580158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>80985167</td>\n",
       "      <td>蓮　舫　・　立　憲　民　主　党　( り　っ　け　ん　)</td>\n",
       "      <td>renho_sha</td>\n",
       "      <td>1.341613</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>772827848985841664</td>\n",
       "      <td>前原誠司</td>\n",
       "      <td>Maehara2016</td>\n",
       "      <td>1.272803</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>536910778</td>\n",
       "      <td>細野豪志　Goshi Hosono</td>\n",
       "      <td>hosono_54</td>\n",
       "      <td>1.163544</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5</td>\n",
       "      <td>96785342</td>\n",
       "      <td>玉木雄一郎（国民民主党代表）</td>\n",
       "      <td>tamakiyuichiro</td>\n",
       "      <td>1.158696</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>6</td>\n",
       "      <td>34773800</td>\n",
       "      <td>逢坂誠二 立憲民主党（りっけん）</td>\n",
       "      <td>seiji_ohsaka</td>\n",
       "      <td>1.133889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>7</td>\n",
       "      <td>96684891</td>\n",
       "      <td>原口　一博</td>\n",
       "      <td>kharaguchi</td>\n",
       "      <td>1.051628</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>8</td>\n",
       "      <td>116097539</td>\n",
       "      <td>小西ひろゆき （参議院議員）</td>\n",
       "      <td>konishihiroyuki</td>\n",
       "      <td>1.026933</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>9</td>\n",
       "      <td>107846407</td>\n",
       "      <td>馬淵澄夫</td>\n",
       "      <td>mabuchi_sumio</td>\n",
       "      <td>0.962776</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>10</td>\n",
       "      <td>45708362</td>\n",
       "      <td>階猛(しな たけし)</td>\n",
       "      <td>shinatakeshi</td>\n",
       "      <td>0.958277</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>11</td>\n",
       "      <td>116426900</td>\n",
       "      <td>山井和則</td>\n",
       "      <td>yamanoikazunori</td>\n",
       "      <td>0.954659</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>12</td>\n",
       "      <td>95338477</td>\n",
       "      <td>有田芳生</td>\n",
       "      <td>aritayoshifu</td>\n",
       "      <td>0.930065</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>13</td>\n",
       "      <td>279935870</td>\n",
       "      <td>長妻昭りっけん立憲民主党</td>\n",
       "      <td>nagatsumaakira</td>\n",
       "      <td>0.886719</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>14</td>\n",
       "      <td>55165402</td>\n",
       "      <td>金子洋一・前参議院議員（神奈川県選出）</td>\n",
       "      <td>Y_Kaneko</td>\n",
       "      <td>0.856139</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>15</td>\n",
       "      <td>157592722</td>\n",
       "      <td>あべともこ（衆議院議員・神奈川１２区・立憲民主党）</td>\n",
       "      <td>abe_tomoko</td>\n",
       "      <td>0.822089</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>16</td>\n",
       "      <td>711473829759946752</td>\n",
       "      <td>民進党</td>\n",
       "      <td>MinshintoNews</td>\n",
       "      <td>0.796128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>17</td>\n",
       "      <td>160175660</td>\n",
       "      <td>長島昭久 Akihisa NAGASHIMA, MP</td>\n",
       "      <td>nagashima21</td>\n",
       "      <td>0.781087</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>18</td>\n",
       "      <td>2904204817</td>\n",
       "      <td>山尾しおり</td>\n",
       "      <td>ShioriYamao</td>\n",
       "      <td>0.774538</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>19</td>\n",
       "      <td>114697823</td>\n",
       "      <td>柚木みちよし</td>\n",
       "      <td>yunoki_m</td>\n",
       "      <td>0.745531</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                    id                         name      screen_name     score\n",
       "0            107039196             福山哲郎・立憲民主党（りっけん）       fuku_tetsu  1.718304\n",
       "1            174604776                        川内 博史  kawauchihiroshi  1.580158\n",
       "2             80985167  蓮　舫　・　立　憲　民　主　党　( り　っ　け　ん　)        renho_sha  1.341613\n",
       "3   772827848985841664                         前原誠司      Maehara2016  1.272803\n",
       "4            536910778            細野豪志　Goshi Hosono        hosono_54  1.163544\n",
       "5             96785342               玉木雄一郎（国民民主党代表）   tamakiyuichiro  1.158696\n",
       "6             34773800             逢坂誠二 立憲民主党（りっけん）     seiji_ohsaka  1.133889\n",
       "7             96684891                        原口　一博       kharaguchi  1.051628\n",
       "8            116097539               小西ひろゆき （参議院議員）  konishihiroyuki  1.026933\n",
       "9            107846407                         馬淵澄夫    mabuchi_sumio  0.962776\n",
       "10            45708362                   階猛(しな たけし)     shinatakeshi  0.958277\n",
       "11           116426900                         山井和則  yamanoikazunori  0.954659\n",
       "12            95338477                         有田芳生     aritayoshifu  0.930065\n",
       "13           279935870                 長妻昭りっけん立憲民主党   nagatsumaakira  0.886719\n",
       "14            55165402          金子洋一・前参議院議員（神奈川県選出）         Y_Kaneko  0.856139\n",
       "15           157592722    あべともこ（衆議院議員・神奈川１２区・立憲民主党）       abe_tomoko  0.822089\n",
       "16  711473829759946752                          民進党    MinshintoNews  0.796128\n",
       "17           160175660   長島昭久 Akihisa NAGASHIMA, MP      nagashima21  0.781087\n",
       "18          2904204817                        山尾しおり      ShioriYamao  0.774538\n",
       "19           114697823                       柚木みちよし         yunoki_m  0.745531"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = list(res)\n",
    "res_df = pd.DataFrame([r.data() for r in res])\n",
    "\n",
    "res_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "最後に重要なノードの大きさをPageRankの値に比例し、リンクの太さをスコアの流れの大きさに比例するようにした図を載せます（政治家のみのネットワークで、PageRank上位25程度のノードを表示、作図はNeo4j Bloomを使用）。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src='./data/neo4j_graph/politician_02_PageRank.png'>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 備考"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- ドキュメント\n",
    "    - Neo4j Document一覧：https://neo4j.com/docs/\n",
    "    - DB管理、インストール、設定config等:https://neo4j.com/docs/operations-manual/current/\n",
    "    - Cyper Query: https://neo4j.com/docs/cypher-manual/current/\n",
    "    - Driver(Pythonなどのプログラムからアクセスする場合): https://neo4j.com/docs/driver-manual/4.0/\n",
    "    - Graph Data Science（内蔵のグラフアルゴリズム）: https://neo4j.com/docs/graph-data-science/current/\n",
    "   \n",
    "- チュートリアル: https://neo4j.com/graphacademy/online-training/\n",
    "- 開発者向けのテーマやトピック：https://neo4j.com/developer/get-started/\n",
    "- 実験的な機能や新しい機能について：https://neo4j.com/labs/"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# back up"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "additional_data_path = './data/neo4j_graph/politicians_0909_additional_huge.json'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(additional_data_path, 'r') as f:\n",
    "    additional_user_data_full = json.load(f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "485"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sum(res_df['count'] > 30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "user_ids = res_df[res_df['count'] > 30].id.to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "additional_user_data = []"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "for u in additional_user_data_full:\n",
    "    if u['id'] in user_ids:\n",
    "        additional_user_data.append(u)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "485"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(additional_user_data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'id': 1247032696586436609, 'id_str': '1247032696586436609', 'name': '岸田文雄', 'screen_name': 'kishida230', 'location': '東京 千代田区', 'description': '自民党政調会長・衆議院議員の岸田文雄です。「分断から協調へ」～公正でやさしい、芯の通った政治～\\u3000宏池会会長／外務大臣・防衛大臣・内閣府特命担当大臣／自民党国会対策委員長など。\\n宏池会webサイトhttps://t.co/VrE7FNJbpM', 'url': 'https://t.co/VKa0dQicFm', 'entities': {'url': {'urls': [{'url': 'https://t.co/VKa0dQicFm', 'expanded_url': 'https://kishida.gr.jp/', 'display_url': 'kishida.gr.jp', 'indices': [0, 23]}]}, 'description': {'urls': [{'url': 'https://t.co/VrE7FNJbpM', 'expanded_url': 'http://kouchikai1957.com', 'display_url': 'kouchikai1957.com', 'indices': [97, 120]}]}}, 'protected': False, 'followers_count': 19469, 'friends_count': 89, 'listed_count': 234, 'created_at': 'Mon Apr 06 05:26:12 +0000 2020', 'favourites_count': 92, 'utc_offset': None, 'time_zone': None, 'geo_enabled': False, 'verified': True, 'statuses_count': 100, 'lang': None, 'status': {'created_at': 'Tue Sep 08 09:59:02 +0000 2020', 'id': 1303271621759660033, 'id_str': '1303271621759660033', 'text': '本日、これから２本のテレビ出演があります。\\n\\n21:54 「報道ステーション」\\n23:00 「NEWS23」\\n\\n総裁選３候補そろい踏み、またNEWS23は収録放送となります。\\nよろしくお願いします。\\n#岸田文雄 #キッシー… https://t.co/oflQ03qnbt', 'truncated': True, 'entities': {'hashtags': [{'text': '岸田文雄', 'indices': [100, 105]}, {'text': 'キッシー', 'indices': [106, 111]}], 'symbols': [], 'user_mentions': [], 'urls': [{'url': 'https://t.co/oflQ03qnbt', 'expanded_url': 'https://twitter.com/i/web/status/1303271621759660033', 'display_url': 'twitter.com/i/web/status/1…', 'indices': [113, 136]}]}, 'source': '<a href=\"https://social.userlocal.jp/\" rel=\"nofollow\">Social Insight Post</a>', 'in_reply_to_status_id': None, 'in_reply_to_status_id_str': None, 'in_reply_to_user_id': None, 'in_reply_to_user_id_str': None, 'in_reply_to_screen_name': None, 'geo': None, 'coordinates': None, 'place': None, 'contributors': None, 'is_quote_status': False, 'retweet_count': 32, 'favorite_count': 141, 'favorited': False, 'retweeted': False, 'possibly_sensitive': False, 'lang': 'ja'}, 'contributors_enabled': False, 'is_translator': False, 'is_translation_enabled': False, 'profile_background_color': 'F5F8FA', 'profile_background_image_url': None, 'profile_background_image_url_https': None, 'profile_background_tile': False, 'profile_image_url': 'http://pbs.twimg.com/profile_images/1303269710125920256/kA7Ad6Jg_normal.jpg', 'profile_image_url_https': 'https://pbs.twimg.com/profile_images/1303269710125920256/kA7Ad6Jg_normal.jpg', 'profile_banner_url': 'https://pbs.twimg.com/profile_banners/1247032696586436609/1586769177', 'profile_link_color': '1DA1F2', 'profile_sidebar_border_color': 'C0DEED', 'profile_sidebar_fill_color': 'DDEEF6', 'profile_text_color': '333333', 'profile_use_background_image': True, 'has_extended_profile': True, 'default_profile': True, 'default_profile_image': False, 'following': False, 'follow_request_sent': False, 'notifications': False, 'translator_type': 'none'}\n",
      "{'id': 903338594, 'id_str': '903338594', 'name': '菅 義偉', 'screen_name': 'sugawitter', 'location': '', 'description': '内閣官房長官・沖縄基地負担軽減担当・拉致問題担当大臣 菅 義偉 公式アカウント。自由民主党8期、元総務大臣、元横浜市会議員。 (事務所スタッフが運営しています)', 'url': 'https://t.co/MtcpaKW81q', 'entities': {'url': {'urls': [{'url': 'https://t.co/MtcpaKW81q', 'expanded_url': 'http://www.sugayoshihide.gr.jp', 'display_url': 'sugayoshihide.gr.jp', 'indices': [0, 23]}]}, 'description': {'urls': []}}, 'protected': False, 'followers_count': 242830, 'friends_count': 5, 'listed_count': 2111, 'created_at': 'Thu Oct 25 06:28:05 +0000 2012', 'favourites_count': 155, 'utc_offset': None, 'time_zone': None, 'geo_enabled': False, 'verified': True, 'statuses_count': 5452, 'lang': None, 'status': {'created_at': 'Tue Sep 08 05:20:30 +0000 2020', 'id': 1303201524659625985, 'id_str': '1303201524659625985', 'text': 'RT @Suga_Ouen: 自民党総裁選。\\n\\xa0\\n菅義偉選対本部の出陣式が開催されました。\\n\\xa0\\n菅義偉議員より、\\n・新型コロナ対策において、国民の命と健康を守り、社会経済活動を両立させ雇用を守り抜く\\n・地方の活力無くして国の活力なし。さらなる地方創生\\nをはじめ政策と決意を述べま…', 'truncated': False, 'entities': {'hashtags': [], 'symbols': [], 'user_mentions': [{'screen_name': 'Suga_Ouen', 'name': '菅義偉を応援する会〜自民党総裁選・令和2年（2020）', 'id': 1301478800195108866, 'id_str': '1301478800195108866', 'indices': [3, 13]}], 'urls': []}, 'source': '<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>', 'in_reply_to_status_id': None, 'in_reply_to_status_id_str': None, 'in_reply_to_user_id': None, 'in_reply_to_user_id_str': None, 'in_reply_to_screen_name': None, 'geo': None, 'coordinates': None, 'place': None, 'contributors': None, 'retweeted_status': {'created_at': 'Tue Sep 08 05:10:11 +0000 2020', 'id': 1303198928649682945, 'id_str': '1303198928649682945', 'text': '自民党総裁選。\\n\\xa0\\n菅義偉選対本部の出陣式が開催されました。\\n\\xa0\\n菅義偉議員より、\\n・新型コロナ対策において、国民の命と健康を守り、社会経済活動を両立させ雇用を守り抜く\\n・地方の活力無くして国の活力なし。さらなる地方創生\\nをはじめ… https://t.co/9PzaK2pJ4q', 'truncated': True, 'entities': {'hashtags': [], 'symbols': [], 'user_mentions': [], 'urls': [{'url': 'https://t.co/9PzaK2pJ4q', 'expanded_url': 'https://twitter.com/i/web/status/1303198928649682945', 'display_url': 'twitter.com/i/web/status/1…', 'indices': [117, 140]}]}, 'source': '<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>', 'in_reply_to_status_id': None, 'in_reply_to_status_id_str': None, 'in_reply_to_user_id': None, 'in_reply_to_user_id_str': None, 'in_reply_to_screen_name': None, 'geo': None, 'coordinates': None, 'place': None, 'contributors': None, 'is_quote_status': False, 'retweet_count': 263, 'favorite_count': 1256, 'favorited': False, 'retweeted': False, 'possibly_sensitive': False, 'lang': 'ja'}, 'is_quote_status': False, 'retweet_count': 263, 'favorite_count': 0, 'favorited': False, 'retweeted': False, 'lang': 'ja'}, 'contributors_enabled': False, 'is_translator': False, 'is_translation_enabled': False, 'profile_background_color': 'C0DEED', 'profile_background_image_url': 'http://abs.twimg.com/images/themes/theme1/bg.png', 'profile_background_image_url_https': 'https://abs.twimg.com/images/themes/theme1/bg.png', 'profile_background_tile': False, 'profile_image_url': 'http://pbs.twimg.com/profile_images/1088615061457797120/o4G61vIJ_normal.jpg', 'profile_image_url_https': 'https://pbs.twimg.com/profile_images/1088615061457797120/o4G61vIJ_normal.jpg', 'profile_link_color': '1DA1F2', 'profile_sidebar_border_color': 'C0DEED', 'profile_sidebar_fill_color': 'DDEEF6', 'profile_text_color': '333333', 'profile_use_background_image': True, 'has_extended_profile': False, 'default_profile': True, 'default_profile_image': False, 'following': False, 'follow_request_sent': False, 'notifications': False, 'translator_type': 'none'}\n"
     ]
    }
   ],
   "source": [
    "for u in additional_user_data:\n",
    "    if u['id'] in [1247032696586436609, 903338594]:\n",
    "        print(u)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open('./data/neo4j_graph/politicians_0909_additional.json', 'w') as f:\n",
    "    json.dump(additional_user_data, f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "graph",
   "language": "python",
   "name": "graph"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
